#+STARTUP: overview hideblocks
#+TITLE: Resume

***** DONE Test your site [[#test-your-site][]]
In order to see your site in action, run Hugo's built-in local server.

#+begin_src bash :session hugo-server :results raw :wrap example
hugo server -w
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Now enter =localhost:1313= in the address bar of your browser.

*** Contacts
#+NAME: contact-conv
#+BEGIN_SRC elisp :var tb=contact-table :results raw :exports results
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: contact-conv
| email    | fa-envelope | mailto: branjam4@gmail.com                   | branjam4@gmail.com                         |
| phone    | fa-phone    | tel:(206)450-1343                            | (206)450-1343                              |
| website  | fa-globe    | //branjam.dev                                | branjam.dev                                |
| linkedin | fa-linkedin | //linkedin.com/in/brandon-ellington-60994b73 | linkedin.com/in/brandon-ellington-60994b73 |
| github   | fa-github   | //github.com/branjam4                        | github.com/branjam4                        |

#+NAME: contact-info
#+BEGIN_SRC elisp :var tbl=contact-conv() :wrap src conf
(mapconcat
 (lambda (x)
   (concat
    "[[params.contact.list]]\n"
    "class = \"" (nth 0 x) "\"\n"
    "icon = \"" (nth 1 x) "\"\n"
    "url = \"" (nth 2 x) "\"\n"
    "title = \"" (nth 3 x) "\"\n"))
 (org-table-to-lisp tbl) "\n")
#+END_SRC

#+RESULTS: contact-info
#+begin_src conf
[[params.contact.list]]
class = "email"
icon = "fa-envelope"
url = "mailto: branjam4@gmail.com"
title = "branjam4@gmail.com"


[[params.contact.list]]
class = "phone"
icon = "fa-phone"
url = "tel:+12064501343"
title = "+12064501343"


[[params.contact.list]]
class = "website"
icon = "fa-globe"
url = "//branjam.dev"
title = "branjam.dev"


[[params.contact.list]]
class = "linkedin"
icon = "fa-linkedin"
url = "//linkedin.com/in/brandon-ellington-60994b73"
title = "linkedin.com/in/brandon-ellington-60994b73"


[[params.contact.list]]
class = "github"
icon = "fa-github"
url = "//github.com/branjam4"
title = "github.com/branjam4"

#+end_src
*** Education
#+NAME: education-conv
#+BEGIN_SRC elisp :var tb=education-table :results raw :exports results
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: education-conv
| 2017-2020 | Bachelor of Science | The Evergreen State College | Majoring in Computer Science |
| 2017-2020 | Bachelor of Arts    | The Evergreen State College | Business Concentration       |

#+NAME: education-list
#+BEGIN_SRC elisp :var tbl=education-conv() :wrap src conf
(mapconcat
 (lambda (x)
   (concat
    "[[params.education.list]]\n"
    "degree = \"" (nth 1 x) "\"\n"
    "college = \"" (nth 2 x) "\"\n"
    "dates = \"" (nth 0 x) "\"\n"))
 (org-table-to-lisp tbl) "\n")
#+END_SRC

#+RESULTS: education-list
#+begin_src conf
[[params.education.list]]
degree = "Bachelor of Science"
college = "The Evergreen State College"
dates = "2017-2020"

[[params.education.list]]
degree = "Bachelor of Arts"
college = "The Evergreen State College"
dates = "2017-2020"
#+end_src
*** Interests
#+NAME: interests-conv
#+BEGIN_SRC elisp :var tb=interests-table :results raw :exports results
(orgtbl-to-orgtbl tb '(:skip 2))
#+END_SRC

#+RESULTS: interests-conv
| 2017-2020 | Bachelor of Science | The Evergreen State College | Majoring in Computer Science |
| 2017-2020 | Bachelor of Arts    | The Evergreen State College | Business Concentration       |

#+NAME: interests-list
#+BEGIN_SRC elisp :var tbl=interests-conv() :wrap src conf
(mapconcat
 (lambda (x)
   (concat
    "[[params.interests.list]]\n"
    "degree = \"" (nth 1 x) "\"\n"
    "college = \"" (nth 2 x) "\"\n"
    "dates = \"" (nth 0 x) "\"\n"))
 (org-table-to-lisp tbl) "\n")
#+END_SRC
*** Experience
#+NAME: experience-conv
#+BEGIN_SRC elisp :var tb=experience-table :results raw :exports results
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: experience-conv
| 2018-2019                  | CRM Lynda.com Fellowship       | The Evergreen State College, Advancement                  | Shadowed the Assistant Director of Advancement Services. Learned how to use the Blackbaud Raiser's Edge Constituent Relationship Management System. Assisted with data management and building complex database query views through SQL and Excel. Served during campaign events.                                                                                                                                                                                                                         |
| September 2017 - June 2018 | Office Manager                 | Services and Activities Fee Allocation Board              | Reduced budget intake, processing from 5 hours/week to <1 hour by moving from paper budgets to Google Drive, Sheets. Trained 12 board members on the function and operations of the Board.                                                                                                                                                                                                                                                                                                                |
| June 2017                  | Enterprise Software Internship | The Evergreen State College, Computing and Communications | Evaluation from my field supervisor, the Senior Systems Analyst/Programmer: \"Brandon's communication skills were particularly valuable to the team. He facilitated requirements gathering sessions with the users in my absence...He was always willing to adjust coding styles and practices to the team approach. He was the only intern I've ever trusted to lead sprint planning sessions, because he had developed the appropriate soft skills, and because he seemed to grasp the Agile process.\" |

#+NAME: experience-list
#+BEGIN_SRC elisp :var tbl=experience-conv() :wrap src conf
(mapconcat
 (lambda (x)
   (concat
    "[[params.jobs.list]]\n"
    "position = \"" (nth 1 x) "\"\n"
    "dates = \"" (nth 0 x) "\"\n"
    "company = \"" (nth 2 x) "\"\n"
    "details = \"" (nth 3 x) "\"\n"))
 (org-table-to-lisp tbl) "\n")
#+END_SRC

#+RESULTS: experience-list
#+begin_src conf
[[params.jobs.list]]
position = "CRM Lynda.com Fellowship"
dates = "2018-2019"
company = "The Evergreen State College, Advancement"
details = "Shadowed the Assistant Director of Advancement Services. Learned how to use the Blackbaud Raiser's Edge Constituent Relationship Management System. Assisted with data management and building complex database query views through SQL and Excel. Served during campaign events."

[[params.jobs.list]]
position = "Office Manager"
dates = "September 2017 - June 2018"
company = "Services and Activities Fee Allocation Board"
details = "Reduced budget intake, processing from 5 hours/week to <1 hour by moving from paper budgets to Google Drive, Sheets. Trained 12 board members on the function and operations of the Board."

[[params.jobs.list]]
position = "Enterprise Software Internship"
dates = "June 2017"
company = "The Evergreen State College, Computing and Communications"
details = "Evaluation from my field supervisor, the Senior Systems Analyst/Programmer: \"Brandon's communication skills were particularly valuable to the team. He facilitated requirements gathering sessions with the users in my absence...He was always willing to adjust coding styles and practices to the team approach. He was the only intern I've ever trusted to lead sprint planning sessions, because he had developed the appropriate soft skills, and because he seemed to grasp the Agile process.\""
#+end_src
*** Projects
#+NAME: projects-conv
#+BEGIN_SRC elisp :var tb=projects-table :results raw :exports results
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: projects-conv
| June 2020     | Containerized Integrated Development Environment | https://github.com/branjam4/doom-emacs-docker.git | I wanted to show some of the productivity gains and programs I had leveraged while learning how to use my development environment. But even though my professor and I both had experience in this development environment, we found it challenging to share programs and configuration strategies given limited time and competing priorities. So I learned to containerize my development environment. Now anyone with Docker can try out my workflows with a couple programs (git, docker) in less than five commands, where previously it could take dozens of programs and commands.                                                                                                                                                                                                                                              |
| 2019-2020     | Systems Thinking Modelling Efforts               | Evergreen: Self-study                             | Evaluation from faculty: \"[Brandon] demonstrated significant expertise in understanding group and team dynamics. He had attended a meeting with the Team Entrepreneurship program and was able to translate their methodology into a systems approach. His work represents a synthesis of basic concepts from graph theory, communication, and systems theory. The origin of the work had several roots: 1. Brandon’s active participation in student governance, 2. Brandon’s interest in the application of systems theory to social systems, and 3. Brandon’s desire to improve communication and information flow in the Evergreen community.\"                                                                                                                                                                                  |
| December 2018 | Authorship- Computational Linguistics Project    | Evergreen Program: Computational Linguistics      | Evaluation from faculty: \"Brandon worked with four other students to complete the project on computationally identifying the author of a text. Their well-coordinated final presentation provided an organized overview of their process and a discussion of both obstacles and successes. Brandon provided leadership and empowerment to newer coders by guiding the group towards a process that emphasized an algorithm and descriptive understandings of what the code needed to accomplished, as well as developing the actual code and some of the details of testing strategies. The group embodied a learning community by making a commitment to make sure that everyone understood the algorithm and the code. Brandon also demonstrated their collaborative learning skills by helping two other groups on the project.\" |
| June 2017     | Sentiment Analysis- Data Mining Project          | United Way of Pierce County                       | Worked with a team of five to leverage sentiment analysis algorithms, collecting data in the form of tweets and posts from Facebook, to quantify how receptive Pierce County residents were to United Way's reports on understanding and assisting Pierce County's ALICE (Asset Limited, Income Constrained, Employed) population. I also went a little further and familiarized myself with the methodology and data used to identify our target demographics, which helped my team put our observations into perspective. My group recognized me as the member who went the extra mile in order to connect with our client and fill their needs.                                                                                                                                                                                    |

#+NAME: projects-list
#+BEGIN_SRC elisp :var tbl=projects-conv() :wrap src conf
(mapconcat
 (lambda (x)
   (concat
    "[[params.projects.list]]\n"
    "title = \"" (nth 1 x) "\"\n"
    "url = \"" (nth 2 x) "\"\n"
    "tagline = \"" (nth 3 x) "\"\n"))
 (org-table-to-lisp tbl) "\n")
#+END_SRC

#+RESULTS: projects-list
#+begin_src conf
[[params.projects.list]]
title = "Containerized Integrated Development Environment"
url = "https://github.com/branjam4/doom-emacs-docker.git"
tagline = "I wanted to show some of the productivity gains and programs I had leveraged while learning how to use my development environment. But even though my professor and I both had experience in this development environment, we found it challenging to share programs and configuration strategies given limited time and competing priorities. So I learned to containerize my development environment. Now anyone with Docker can try out my workflows with a couple programs (git, docker) in less than five commands, where previously it could take dozens of programs and commands."

[[params.projects.list]]
title = "Systems Thinking Modelling Efforts"
url = "Evergreen: Self-study"
tagline = "Evaluation from faculty: \"[Brandon] demonstrated significant expertise in understanding group and team dynamics. He had attended a meeting with the Team Entrepreneurship program and was able to translate their methodology into a systems approach. His work represents a synthesis of basic concepts from graph theory, communication, and systems theory. The origin of the work had several roots: 1. Brandon’s active participation in student governance, 2. Brandon’s interest in the application of systems theory to social systems, and 3. Brandon’s desire to improve communication and information flow in the Evergreen community.\""

[[params.projects.list]]
title = "Authorship- Computational Linguistics Project"
url = "Evergreen Program: Computational Linguistics"
tagline = "Evaluation from faculty: \"Brandon worked with four other students to complete the project on computationally identifying the author of a text. Their well-coordinated final presentation provided an organized overview of their process and a discussion of both obstacles and successes. Brandon provided leadership and empowerment to newer coders by guiding the group towards a process that emphasized an algorithm and descriptive understandings of what the code needed to accomplished, as well as developing the actual code and some of the details of testing strategies. The group embodied a learning community by making a commitment to make sure that everyone understood the algorithm and the code. Brandon also demonstrated their collaborative learning skills by helping two other groups on the project.\""

[[params.projects.list]]
title = "Sentiment Analysis- Data Mining Project"
url = "United Way of Pierce County"
tagline = "Worked with a team of five to leverage sentiment analysis algorithms, collecting data in the form of tweets and posts from Facebook, to quantify how receptive Pierce County residents were to United Way's reports on understanding and assisting Pierce County's ALICE (Asset Limited, Income Constrained, Employed) population. I also went a little further and familiarized myself with the methodology and data used to identify our target demographics, which helped my team put our observations into perspective. My group recognized me as the member who went the extra mile in order to connect with our client and fill their needs."
#+end_src

*** Skills
#+NAME: skills-conv
#+BEGIN_SRC elisp :var tb=skills-table :results raw :exports results
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: skills-conv
| Python                      |   4 |
| Functional Programming      | 4.4 |
| Object-Oriented Programming |   4 |
| Database Management         | 3.8 |
| DevOps                      |   3 |

#+NAME: skills-list
#+BEGIN_SRC elisp :var tbl=skills-conv() :wrap src conf
(mapconcat
 (lambda (x)
   (concat
    "[[params.skills.list]]\n"
    "skill = \"" (nth 0 x) "\"\n"
    "level = \"" (number-to-string (* (/ (string-to-number (nth 1 x)) 6.0) 100)) "%\"\n"))
 (org-table-to-lisp tbl) "\n")
#+END_SRC

#+RESULTS: skills-list
#+begin_src conf
[[params.skills.list]]
skill = "Python"
level = "66.66666666666666%"

[[params.skills.list]]
skill = "Functional Programming"
level = "73.33333333333334%"

[[params.skills.list]]
skill = "Object-Oriented Programming"
level = "66.66666666666666%"

[[params.skills.list]]
skill = "Database Management"
level = "63.33333333333333%"

[[params.skills.list]]
skill = "DevOps"
level = "50.0%"
#+end_src

